-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Feb 14, 2023 at 10:26 PM
-- Server version: 10.4.25-MariaDB
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `exam`
--
CREATE DATABASE IF NOT EXISTS `exam` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `exam`;

-- --------------------------------------------------------

--
-- Table structure for table `answers`
--

CREATE TABLE `answers` (
  `id` int(11) NOT NULL,
  `answer` text NOT NULL,
  `question_id` int(11) NOT NULL,
  `date` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `answers`
--

INSERT INTO `answers` (`id`, `answer`, `question_id`, `date`) VALUES
(1, 'نظم التشغيل المكتبية', 1, '2023-02-11'),
(2, 'نظم التشغيل الشبكية', 1, '2023-02-11'),
(3, 'نظم التشغيل للإجهزة الصغيرة', 1, '2023-02-11'),
(4, 'للتحكم بالإجهزة المحمولة والصغيرة', 2, '2023-02-11'),
(6, 'الأنسان الألي', 3, '2023-02-11'),
(7, 'نظام مفتوح المصدر ومجاني', 4, '2023-02-11'),
(8, ' لأن هذه الأجهزة تجعل حیاتنا سهلة وجميله مثل الحلويات', 5, '2023-02-11'),
(9, 'واجهة برمجة التطبيق', 6, '2023-02-11'),
(10, 'طبقة التطبیقات', 7, '2023-02-11'),
(11, 'طبقة إطار العمل', 7, '2023-02-11'),
(12, 'طبقة المكتبات الأساسیة', 7, '2023-02-11'),
(13, 'طبقة بیئة التشغیل', 7, '2023-02-11'),
(14, 'طبقة نواة اللينكس', 7, '2023-02-11'),
(15, 'تحتوي على التطبیقات المختلفة المبنیة في النظام', 8, '2023-02-11'),
(16, 'توفر ھذه الطبقة للمبرمجة القدرة على التعامل مع مكونات النظام المادیة والبرمجیة', 9, '2023-02-11'),
(17, 'تحتوي على الأكواد الأساسیة للمكتبات', 10, '2023-02-11'),
(18, 'هي المسؤولة عن تنفیذ التطبیق و تشغیل البیئة التشغیلیة للتطبیقات', 11, '2023-02-11'),
(19, ' هي نواة النظام الأساسیة و جمیع التعاملات الحقیقة مع المكونات المادیة في الجهاز تتم من خلالها', 12, '2023-02-11'),
(20, 'التطبيقات الاصلية وتطبيقات الويب والتطبيقات المدمجة', 13, '2023-02-11'),
(21, 'تعمل مباشرة مع نظام التشغیل باستخدام مكتبات SDK وتستطیع استخدام جمیع خدمات الجهاز بكفاءة عالیة  وهذه البرامج مصممة خصیصا لنوع معین من الأجهزة  او الأنظمة', 14, '2023-02-11'),
(22, 'تستخدم مكتبات الویب للتخاطب مع نظام التشغیل و تستخدم قدرة المحمول على تصفح النت و لا تعتمد على نظام  تشغيل معین و لا تستطیع استخدام خدمات الجهاز الخاصة', 15, '2023-02-11'),
(23, 'یتم عادة كتابة هذه التطبیقات مرة واحدة ثم یتم ترجمتها عدة مرات لكل جهاز على حدة  و تستخدم مكتبات خاصة بها لتتخاطب مع نظام التشغیل', 16, '2023-02-11'),
(24, 'Kotlin', 17, '2023-02-11'),
(25, 'Objective-C', 17, '2023-02-11'),
(26, 'Swift', 17, '2023-02-11'),
(27, 'Flatter', 18, '2023-02-11'),
(28, 'Flash (Animate)', 18, '2023-02-11'),
(29, 'cordova', 18, '2023-02-11'),
(30, 'xamarin', 19, '2023-02-11'),
(31, 'تعتمد هذه الطريقة على تكوين فئات ينشأ منها كائن تتفاعل في ما بينها لحل مشكلة معينة', 20, '2023-02-11'),
(32, 'يحمل البرنامج في الذاكرة ثم  ينتظر حدث او طلب من المستخدم ليقوم بتنفيذه ثم يعود لحاله الانتظار لطلب او لحدث اخر', 21, '2023-02-11'),
(33, 'حدث النقر على الفأره', 22, '2023-02-11'),
(34, 'النشاط', 23, '2023-02-11'),
(35, 'الجلسة', 23, '2023-02-11'),
(36, 'الخدمات', 23, '2023-02-11'),
(37, 'مزود المحتوى', 23, '2023-02-11'),
(38, 'مستقبلات البثوث', 23, '2023-02-11'),
(39, 'تعریف عام عن العملیات التي یرید التطبیق القیام بها', 24, '2023-02-11'),
(40, 'هي التي تقوم بالعملیات الخاصة بالتطبیق في الخلفیة', 25, '2023-02-11'),
(41, 'یوفر هذا المكون للتطبیق الوصول إلى نظم الملفات بمختلف أنواعھا والتي یسمح لتطبیق الوصول إليها والتعامل معها', 26, '2023-02-11'),
(42, 'توفر للتطبیق القدرة على الاستجابة لأحداث النظام (الغير مباشرة) مثل ورود ایمیل جدید في صندوق المستخدم او دخول الجهاز في عملیة السبات او تغیر حالة الشاشة', 27, '2023-02-11'),
(43, 'باستخدام الاحداث', 28, '2023-02-11'),
(44, 'بناء واجهة التطبيق', 29, '2023-02-11'),
(45, 'كتابة الإكواد البرمجية', 29, '2023-02-11'),
(46, 'تعدد أنواع واشكال واحجام الأجهزة', 30, '2023-02-11'),
(47, 'تعدد المكتبات وتشعبھا وتنوع اصداراتها', 30, '2023-02-11'),
(48, 'تعدد وتجدد نظم التشغیل المختلفة وخاصة الأندروید', 30, '2023-02-11'),
(49, 'عبارة عن قالب مخصص لوصف عنصر في أداة عرض اخرى', 31, '2023-02-11'),
(50, 'هو نظام تنسيق العام لأدوات التي تظهر داخل سمة محتوى', 32, '2023-02-11'),
(51, 'نسق التكديس', 33, '2023-02-11'),
(52, 'نسق المرن', 33, '2023-02-11'),
(53, 'النسق النسبي', 33, '2023-02-11'),
(54, 'النسق الثابت', 33, '2023-02-11'),
(55, 'هي الحاوية لجميع المناظر التي يعرضها النشاط', 34, '2023-02-11'),
(56, 'الصفحة الطائره', 35, '2023-02-11'),
(57, 'صفحة المحتوى', 35, '2023-02-11'),
(58, 'صفحه الابحار', 35, '2023-02-11'),
(59, 'صفحة القالب', 35, '2023-02-11'),
(60, 'المنظر', 36, '2023-02-11'),
(61, 'والصفحة', 36, '2023-02-11'),
(62, 'النسق', 36, '2023-02-11'),
(63, 'الخلية', 36, '2023-02-11'),
(64, 'هو تسمية الزامرن للأدوات البرمجية التي تعرض على النشاط', 37, '2023-02-11'),
(65, 'سمات المحتوى', 38, '2023-02-11'),
(66, 'سمات الادوات', 38, '2023-02-11'),
(67, 'سمات التحكم', 38, '2023-02-11'),
(68, 'لان التخطيط سر النجاح في كل شيئ وخاصة البرمجة وتفادي وتخفيف تعقيدات الكود البرمجي وتنفيذ البرنامج في افضل صوره ممكنة', 39, '2023-02-11'),
(69, 'تخطيط الفكره العامة', 40, '2023-02-11'),
(70, 'تخطيط واجهة الاستخدام يدويا', 40, '2023-02-11'),
(71, 'برمجة واجهة كنسخة اولية للبرنامج', 40, '2023-02-11'),
(72, 'كتابة الكود البرمجي الفعلي', 40, '2023-02-11'),
(73, 'تجربه البرنامج من قبل المستخدم', 40, '2023-02-11'),
(74, 'تسليم البرنامج ومستلزماته', 40, '2023-02-11'),
(75, 'يشرح طريقة التعامل مع البرنامج بالتفصيل', 41, '2023-02-11'),
(76, 'الوضوح', 42, '2023-02-11'),
(77, 'التناسق', 42, '2023-02-11'),
(78, 'الاستجابة', 42, '2023-02-11'),
(79, 'الربط', 42, '2023-02-11'),
(80, 'قابلية الاستكشاف', 42, '2023-02-11'),
(81, 'القيود', 42, '2023-02-11'),
(82, 'وضوح الادوات للمستخدم داخل الشاشه', 43, '2023-02-11'),
(83, 'الحفاظ على شكل واحد في كل الصفحة والحفاظ على طريقه واحدة لعمل شيئ معين', 44, '2023-02-11'),
(84, 'اخبار المستخدم بنتيجة طلبة', 45, '2023-02-11'),
(85, 'الربط بين اداة التحكم وعملها في عالمها', 46, '2023-02-11'),
(86, 'شكل الاداة يدل على طريقه استخدامها', 47, '2023-02-11'),
(87, 'السماح للمستخدم بالقيام بالأخطاء بإمكانية التراجع', 48, '2023-02-11'),
(88, 'تقييد مساحة التفاعل المتاحة للمستخدم  ومساعدته كذلك في استخدام واجباته', 49, '2023-02-11'),
(89, 'هي مكون من مكونات تطبيقات الأندرويد قادر على معالجة الأوامر او العمليات التي تحتاج لوقت طويل في خلفية النظام', 50, '2023-02-11'),
(90, 'تبقى الخدمة تعمل حتى تنهي عملها ولو انتقل المستخدم ل تطبيق اخر', 51, '2023-02-11'),
(91, 'تستخدم كحل لأعطاء المستخدم التحكم في اثناء انهاء احد الاعمال الطويلة المطلوب من التطبيق القيام بها', 52, '2023-02-11'),
(92, 'هي اصغر سلسلة من التعليمات المبرمجة اللتي يمكن ادارتها بشكل مستقل بواسطه المجدول\r\n', 53, '2023-02-11'),
(93, 'تتميز السلاسل بأنها تنفذ من قبل المعالج في نفس الوقت  يمكن لسلسلتين ان تعملان في نفس الوقت بعكس البرامج العادية التي لا يمكن تنفيذ سطر إلى بنهاية السطر الذي قبله', 54, '2023-02-11'),
(94, ' يعني ان المعالج يستطيع تشغيل اكثر من برنامج في نفس الوقت', 55, '2023-02-11'),
(95, 'الخدمات المقدمه وهي خدمات يستطيع المستخدم التعامل معها\r\n', 56, '2023-02-11'),
(96, 'الخدمات الخلفية خدمات لا يستطيع او يعلم المستخدم وجودها بشكل مباشر', 56, '2023-02-11'),
(97, 'خدمات الربط وهي خدمات مرتبطة ب احد مكونات التطبيق', 56, '2023-02-11'),
(98, 'خدمات يعلم المستخدم بوجودها ويستطيع التحكم بها بشكل مباشر', 57, '2023-02-11'),
(99, 'تعمل دون ان يشعر بها المستخدم بشكل مباشر', 58, '2023-02-11');

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` int(10) UNSIGNED NOT NULL,
  `question` text NOT NULL,
  `unit` int(11) NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `question`, `unit`, `date`) VALUES
(1, 'ماهي انواع نظم التشغيل؟', 1, '2023-02-11 01:44:11'),
(2, 'نظام أندرويد مخصص ل:', 1, '2023-02-11 02:30:45'),
(3, 'ما معنى اسم اندرويد؟', 1, '2023-02-11 03:20:10'),
(4, 'من مميزات نظام الأندرويد:', 1, '2023-02-11 03:39:25'),
(5, 'لماذا سمیت الإصدارات الأولى للنظام بأسماء الحلویات ؟', 1, '2023-02-11 17:53:54'),
(6, 'الى ماذا يرمز مصطلح  ال API؟', 1, '2023-02-11 17:56:16'),
(7, 'ماهي احد طبقات نظام الأندرويد؟', 1, '2023-02-11 17:57:19'),
(8, 'على ماذا تحتوي طبقة التطبيقات؟', 1, '2023-02-11 17:59:55'),
(9, 'ماهي طبقة اطار العمل؟', 1, '2023-02-11 18:00:28'),
(10, 'ماهي طبقة المكتبات الاساسية؟', 1, '2023-02-11 18:01:56'),
(11, 'ماهي طبقة بيئة العمل؟', 1, '2023-02-11 18:02:50'),
(12, 'ماهي طبقة نواة اللنكس؟', 1, '2023-02-11 18:04:09'),
(13, 'ماهي انواع التطبيقات؟', 2, '2023-02-11 18:05:49'),
(14, 'ماهي التطبيقات الاصلية؟', 2, '2023-02-11 18:07:30'),
(15, 'ماهي تطبيقات الويب؟', 2, '2023-02-11 18:08:53'),
(16, 'ماهي التطبيقات المدمجة؟', 2, '2023-02-11 18:10:17'),
(17, 'أمثلة للغات برمجة التطبیقات الأصلیة؟', 2, '2023-02-11 18:11:19'),
(18, 'أمثلة للغات برمجة التطبیقات للویب؟', 2, '2023-02-11 18:12:46'),
(19, 'ماهي التقنية المستخدمة ببرمجة التطبیقات المدمجة؟', 2, '2023-02-11 18:14:44'),
(20, 'ماهي البرمجة الشيئية؟', 2, '2023-02-11 18:30:27'),
(21, 'ماهي البرمجة الموجهة بالاحداث؟', 2, '2023-02-11 18:32:10'),
(22, 'مثال على الاحداث؟', 2, '2023-02-11 18:33:03'),
(23, 'ماهي مكونات التطبيق؟', 2, '2023-02-11 18:33:40'),
(24, 'ماهو النشاط او الجلسة؟', 2, '2023-02-11 18:35:48'),
(25, 'ماهي الخدمات؟', 2, '2023-02-11 18:36:42'),
(26, 'ماهو مزود المحتوى؟', 2, '2023-02-11 18:37:49'),
(27, 'ماهي مستقبلات البث؟', 2, '2023-02-11 18:38:36'),
(28, 'كيف يتم التواصل بين اجزاء التطبيق؟', 2, '2023-02-11 18:39:46'),
(29, 'على ماذا تشمل مرحلة التصمیم المرئي؟ [بناء واجهة التطبيق]', 3, '2023-02-11 19:54:39'),
(30, 'من مشاكل تعدد الواجهات ل الاجهزة الذكية هي:', 3, '2023-02-11 19:56:54'),
(31, 'ماهي الخلية؟', 3, '2023-02-11 19:59:21'),
(32, 'ماهي النسق؟', 3, '2023-02-11 19:59:57'),
(33, 'انواع النسق هي:', 3, '2023-02-11 20:00:33'),
(34, 'ماهي الصفحة؟', 3, '2023-02-11 20:01:40'),
(35, 'ماهي انواع الصفحات؟', 3, '2023-02-11 20:02:07'),
(36, 'من المكونات الاساسية ل النشاط في الزامرن؟', 3, '2023-02-11 20:03:38'),
(37, 'ماهو المنظر؟', 3, '2023-02-11 20:04:44'),
(38, 'من انواع السمات في الزامرن هي:', 3, '2023-02-11 20:05:23'),
(39, 'لماذا نستخدم خطوات تصميم البرنامج؟', 4, '2023-02-11 20:11:16'),
(40, 'من خطوات تصميم البرنامج هي:', 4, '2023-02-11 20:11:58'),
(41, 'ماهي وظيفة ملف الاستخدام؟', 4, '2023-02-11 20:14:27'),
(42, 'من اجزاء نظريه دان نورمان هي:', 4, '2023-02-11 20:15:11'),
(43, 'من الأمثلة على الوضوح في نظريه دان نورمان هي؟', 4, '2023-02-11 20:17:13'),
(44, 'من الأمثلة على التناسق في نظريه دان نورمان هي:', 4, '2023-02-11 20:46:04'),
(45, 'من الأمثلة على الاستجابة في نظريه دان نورمان:', 4, '2023-02-11 20:47:16'),
(46, 'من الأمثلة على الربط في نظريه دان نورمان هي:', 4, '2023-02-11 20:47:52'),
(47, 'من الأمثلة على على قابلية الاستكشاف  في نظريه دان نورمان هي:', 4, '2023-02-11 20:48:24'),
(48, 'من الأمثلة على قابلية التعليم في نظريه دان نورمان هي:', 4, '2023-02-11 20:49:07'),
(49, 'من الأمثلة على القيود في نظريه دان نورمان هي:', 4, '2023-02-11 20:49:50'),
(50, 'ماهي الخدمات؟', 5, '2023-02-11 20:51:08'),
(51, 'من خصائص الخدمات؟', 5, '2023-02-11 20:51:59'),
(52, 'ماهي وظيفه الخدمه؟', 5, '2023-02-11 20:53:00'),
(53, 'ماهي سلاسل التنفيذ؟ [thread]', 5, '2023-02-11 20:53:42'),
(54, 'من مميزات سلاسل التنفيذ هي:', 5, '2023-02-11 20:54:14'),
(55, 'ماذا يعني مصطلح [Multi - processing]؟', 5, '2023-02-11 20:54:56'),
(56, 'ماهي انواع الخدمات', 5, '2023-02-11 20:55:21'),
(57, 'بماذا تتميز خدمات المقدمة؟', 5, '2023-02-11 20:57:17'),
(58, 'بماذا تتميز خدمات الخلفية', 5, '2023-02-11 20:58:36');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `answers`
--
ALTER TABLE `answers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `answers`
--
ALTER TABLE `answers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=100;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=59;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
